# IsDocumentUsingEnergyDataAnalyticalModel Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..IsDocumentUsingEnergyDataAnalyticalModel Method
EnergyDataSettings Class See Also
---
Get EnergyDataSettings element and if it exists, return result from getCreateAnalyticalModel.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static bool IsDocumentUsingEnergyDataAnalyticalModel(
	Document ccda
)
```

Visual Basic
---
```text
Public Shared Function IsDocumentUsingEnergyDataAnalyticalModel ( _
	ccda As Document _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsDocumentUsingEnergyDataAnalyticalModel(
	Document^ ccda
)
```

# ### Parameters
ccda
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
Returns true if the Conceptual Energy Analytical Model is enabled, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace